In [3]:
%pip install pandas

Collecting pandas
  Using cached pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\new game\coding-challenges\python\.venv\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\new game\coding-challenges\python\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\new game\coding-challenges\python\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
Using cached pytz-2025.1-py2.py3-none-any.whl (507 kB)
Using cached tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.1 tzdata-2025.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
import pandas as pd
table={"Student":["David","Samuel","Terry","Evan"],"Age":[27,24,22,32],"Country":["UK","Canada","China","USA"],"Course":["Python","Data Structures","Machine Learning","Web Developent"],"Marks":[85,72,89,76]}

In [6]:
b= pd.DataFrame(table)
b

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA    Web Developent     76

In [9]:
w=b[["Country","Course"]]
w

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA    Web Developent

In [17]:
c=b[b["Age"]>23]
c

  Student  Age Country           Course  Marks
0   David   27      UK           Python     85
1  Samuel   24  Canada  Data Structures     72
3    Evan   32     USA   Web Developent     76